uhnp/src/Catalogs/ВариантыАналитическихПанелей/ВариантыАналитическихПанелей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВариантыАналитическихПанелей</name>
  <attributes>
    <name>ШаблонПанели</name>
    <type>
      <types>CatalogRef.АналитическиеПанели</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоОсновнойВариант</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиСКД</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОтчета</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОкончания</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьЗаголовкиСтраниц</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РазметкаПанели</name>
    <attributes>
      <name>ИмяСтраницы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИндексСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИндексКолонки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяЭлемента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипОбъекта</name>
      <type>
        <types>EnumRef.ВидыЭлементовАналитическойПанели</types>
      </type>
    </attributes>
    <attributes>
      <name>НастройкиЭлемента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаголовокЭлемента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяГруппыЭлемента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизитаФормы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкрытьЗаголовокЭлемента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторОбъекта</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗафиксироватьОтборы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтраницыПанели</name>
    <attributes>
      <name>ИмяСтраницы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заголовок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИндексСтраницы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Видимость</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Catalogs/ВариантыАналитическихПанелей/Forms/ФормаВыбора/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
  ШаблонПанели = Параметры.ШаблонПанели;	

   
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьДанныеДругихАвторовПриИзменении(Элемент)
	
  ПолучитьСписокВариантов();	
  Элементы.Список.Обновить();

КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
 ПолучитьСписокВариантов();	
	 
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокВариантов()
	
  ШаблонПанели = Параметры.ШаблонПанели;	

  Запрос = Новый Запрос;
  Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
                 |	ВложенныйЗапрос.Ссылка КАК Ссылка
                 |ИЗ
                 |	(ВЫБРАТЬ
                 |		СправочникВариантыАналитическихПанелей.Ссылка КАК Ссылка,
                 |		СправочникВариантыАналитическихПанелей.Код КАК Код,
                 |		СправочникВариантыАналитическихПанелей.Наименование КАК Наименование,
                 |		СправочникВариантыАналитическихПанелей.ЭтоОсновнойВариант КАК ЭтоОсновнойВариант,
                 |		СправочникВариантыАналитическихПанелей.Автор КАК Автор
                 |	ИЗ
                 |		Справочник.ВариантыАналитическихПанелей КАК СправочникВариантыАналитическихПанелей
                 |	ГДЕ
                 |		СправочникВариантыАналитическихПанелей.Автор = &Пользователь
                 |		И СправочникВариантыАналитическихПанелей.ШаблонПанели = &ШаблонПанели
                 |	
                 |	ОБЪЕДИНИТЬ ВСЕ
                 |	
                 |	ВЫБРАТЬ
                 |		СправочникВариантыАналитическихПанелей.Ссылка,
                 |		СправочникВариантыАналитическихПанелей.Код,
                 |		СправочникВариантыАналитическихПанелей.Наименование,
                 |		СправочникВариантыАналитическихПанелей.ЭтоОсновнойВариант,
                 |		СправочникВариантыАналитическихПанелей.Автор
                 |	ИЗ
                 |		Справочник.ВариантыАналитическихПанелей КАК СправочникВариантыАналитическихПанелей
                 |	ГДЕ
                 |		&ОтображатьДанныеДругихАвторов
                 |		И СправочникВариантыАналитическихПанелей.Пользователи.Пользователь = &Пользователь
                 |		И СправочникВариантыАналитическихПанелей.ШаблонПанели = &ШаблонПанели
                 |	
                 |	ОБЪЕДИНИТЬ ВСЕ
                 |	
                 |	ВЫБРАТЬ
                 |		СправочникВариантыАналитическихПанелей.Ссылка,
                 |		СправочникВариантыАналитическихПанелей.Код,
                 |		СправочникВариантыАналитическихПанелей.Наименование,
                 |		СправочникВариантыАналитическихПанелей.ЭтоОсновнойВариант,
                 |		СправочникВариантыАналитическихПанелей.Автор
                 |	ИЗ
                 |		Справочник.ВариантыАналитическихПанелей КАК СправочникВариантыАналитическихПанелей
                 |	ГДЕ
                 |		СправочникВариантыАналитическихПанелей.ЭтоОсновнойВариант = ИСТИНА
                 |		И СправочникВариантыАналитическихПанелей.ШаблонПанели = &ШаблонПанели) КАК ВложенныйЗапрос";
  
  Запрос.УстановитьПараметр("Пользователь",ОбщегоНазначенияУХ.ТекущийПользователь());
  Запрос.УстановитьПараметр("ШаблонПанели",ШаблонПанели);
  Запрос.УстановитьПараметр("ОтображатьДанныеДругихАвторов",ОтображатьДанныеДругихАвторов);
  
  СписокВариантов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
  
  ЭтаФорма.Список.Параметры.УстановитьЗначениеПараметра("СписокВариантов",СписокВариантов);

   
КонецПроцедуры
